<div class="sidebar-student">
    <div class="general">
        <h1>Trung tâm</h1>
    </div>
    <div class="general-2 pointer">
        <div class="text">
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M20 17V11.4521V11.4513C20 10.9175 20 10.6505 19.9351 10.4019C19.8775 10.1816 19.7827 9.97263 19.6548 9.7842C19.5104 9.57158 19.3096 9.39569 18.9074 9.04383L14.1074 4.84383C13.3608 4.19054 12.9875 3.86394 12.5674 3.7397C12.1972 3.63022 11.8028 3.63022 11.4326 3.7397C11.0127 3.86387 10.6398 4.19019 9.894 4.84275L9.89278 4.84383L5.09277 9.04383L5.09182 9.04466C4.69032 9.39597 4.48944 9.57174 4.34521 9.7842C4.2173 9.97263 4.12255 10.1816 4.06497 10.4019C4 10.6506 4 10.9178 4 11.4521V17C4 17.9319 4 18.3978 4.15224 18.7653C4.35523 19.2554 4.74481 19.6447 5.23486 19.8477C5.60241 20 6.06835 20 7.00023 20C7.93211 20 8.39782 20 8.76537 19.8477C9.25542 19.6447 9.64467 19.2554 9.84766 18.7653C9.9999 18.3978 10 17.9318 10 17V16C10 14.8954 10.8954 14 12 14C13.1046 14 14 14.8954 14 16V17C14 17.9318 14 18.3978 14.1522 18.7653C14.3552 19.2554 14.7448 19.6447 15.2349 19.8477C15.6024 20 16.0683 20 17.0002 20C17.9321 20 18.3978 20 18.7654 19.8477C19.2554 19.6447 19.6447 19.2554 19.8477 18.7653C19.9999 18.3978 20 17.9319 20 17Z" stroke="#E14177" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
            <p>Thông tin chung</p>
        </div>
        <svg class="svg-bottom" xmlns="http://www.w3.org/2000/svg" width="24" height="30" viewBox="0 0 24 30" fill="none">
            <path d="M5 18.75L12 10L19 18.75" stroke="#0C0C0D" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
    </div>
    <div class="general-deeper pointer">
        <p>Tin tức</p>
    </div>
    <div class="study">
        <h1>Học tập</h1>
    </div>
    <div class="study-2 pointer">
        <div class="text">
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M4.21799 5.09204L5.10899 5.54603L4.21799 5.09204ZM5.0918 4.21799L5.54579 5.10899L5.0918 4.21799ZM5.0918 19.782L5.54579 18.891L5.54579 18.891L5.0918 19.782ZM4.21799 18.908L3.32698 19.362L3.32698 19.362L4.21799 18.908ZM19.7822 18.908L18.8912 18.454L19.7822 18.908ZM18.9078 19.782L18.4538 18.891L18.9078 19.782ZM19.7822 5.09204L18.8912 5.54603L18.8912 5.54603L19.7822 5.09204ZM18.9078 4.21799L19.3618 3.32698L19.3618 3.32698L18.9078 4.21799ZM12 10C11.4477 10 11 10.4477 11 11C11 11.5523 11.4477 12 12 12V10ZM16 12C16.5523 12 17 11.5523 17 11C17 10.4477 16.5523 10 16 10V12ZM12 7C11.4477 7 11 7.44772 11 8C11 8.55228 11.4477 9 12 9V7ZM16 9C16.5523 9 17 8.55228 17 8C17 7.44772 16.5523 7 16 7V9ZM7 20C7 20.5523 7.44772 21 8 21C8.55228 21 9 20.5523 9 20L7 20ZM9 4C9 3.44772 8.55229 3 8 3C7.44772 3 7 3.44772 7 4L9 4ZM19 7.20001V16.8H21V7.20001H19ZM16.8002 19H7.2002V21H16.8002V19ZM5 16.8V7.20001H3V16.8H5ZM7.2002 5H16.8002V3H7.2002V5ZM5 7.20001C5 6.62346 5.00078 6.25119 5.02393 5.96785C5.04612 5.69619 5.0838 5.59548 5.10899 5.54603L3.32698 4.63805C3.13419 5.01643 3.06287 5.40964 3.03057 5.80499C2.99922 6.18866 3 6.65646 3 7.20001H5ZM7.2002 3C6.65663 3 6.18874 2.99922 5.80498 3.03057C5.40962 3.06286 5.01624 3.13416 4.63781 3.32698L5.54579 5.10899C5.59517 5.08383 5.69595 5.04613 5.9678 5.02393C6.25126 5.00078 6.62365 5 7.2002 5V3ZM5.10899 5.54603C5.205 5.35761 5.35788 5.20474 5.54579 5.10899L4.63781 3.32698C4.07306 3.61473 3.61447 4.07382 3.32698 4.63805L5.10899 5.54603ZM7.2002 19C6.62367 19 6.25127 18.9992 5.96782 18.9761C5.69598 18.9538 5.59519 18.9161 5.54579 18.891L4.63781 20.673C5.01623 20.8658 5.40959 20.9371 5.80496 20.9694C6.18873 21.0008 6.65662 21 7.2002 21V19ZM3 16.8C3 17.3436 2.99922 17.8114 3.03057 18.195C3.06287 18.5904 3.13419 18.9836 3.32698 19.362L5.10899 18.454C5.0838 18.4045 5.04612 18.3038 5.02393 18.0322C5.00078 17.7488 5 17.3766 5 16.8H3ZM5.54579 18.891C5.35784 18.7952 5.20498 18.6424 5.10899 18.454L3.32698 19.362C3.61449 19.9262 4.0731 20.3853 4.63781 20.673L5.54579 18.891ZM19 16.8C19 17.3767 18.9993 17.7489 18.9762 18.0323C18.954 18.304 18.9164 18.4046 18.8912 18.454L20.6732 19.362C20.8661 18.9835 20.9373 18.5902 20.9696 18.1949C21.0008 17.8113 21 17.3435 21 16.8H19ZM16.8002 21C17.3438 21 17.8115 21.0008 18.1951 20.9694C18.5904 20.9371 18.9835 20.8657 19.3618 20.673L18.4538 18.891C18.4043 18.9162 18.3036 18.9539 18.0321 18.9761C17.7489 18.9992 17.3767 19 16.8002 19V21ZM18.8912 18.454C18.7956 18.6417 18.6424 18.7949 18.4538 18.891L19.3618 20.673C19.9258 20.3856 20.3854 19.9269 20.6732 19.362L18.8912 18.454ZM21 7.20001C21 6.65656 21.0008 6.18875 20.9696 5.80515C20.9373 5.40986 20.8661 5.01654 20.6732 4.63805L18.8912 5.54603C18.9164 5.59536 18.954 5.69598 18.9762 5.9677C18.9993 6.2511 19 6.62336 19 7.20001H21ZM16.8002 5C17.3768 5 17.7489 5.00078 18.0321 5.02393C18.3036 5.04611 18.4043 5.08377 18.4538 5.10899L19.3618 3.32698C18.9835 3.13421 18.5904 3.06288 18.1951 3.03057C17.8115 2.99922 17.3437 3 16.8002 3V5ZM20.6732 4.63805C20.3854 4.07315 19.9259 3.61439 19.3618 3.32698L18.4538 5.10899C18.6424 5.20508 18.7956 5.35828 18.8912 5.54603L20.6732 4.63805ZM12 12H16V10H12V12ZM12 9H16V7H12V9ZM9 20L9 4L7 4L7 20L9 20Z" fill="#01B3EF"/>
            </svg>
            <p>Học tập<p>
        </div>
        <svg class="svg-bottom" xmlns="http://www.w3.org/2000/svg" width="24" height="30" viewBox="0 0 24 30" fill="none">
            <path d="M5 18.75L12 10L19 18.75" stroke="#0C0C0D" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
    </div>
    <div class="study-deeper">
        <div class="score pointer">
            <p>Xem điểm</p>
        </div>
        <div class="conduct pointer">
            <p>Xem hạnh kiểm</p>
        </div>
        <div class="result pointer">
            <p>Kết quả tổng kết</p>
        </div>
    </div>
    <div class="fee">
        <h1>Học phí</h1>
    </div>
    <div class="fee-2 pointer">
        <div class="text">
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                <path d="M19.7654 6.15224L20.1481 5.22836L20.1481 5.22836L19.7654 6.15224ZM20.9999 8.99999V9.99999C21.5522 9.99999 21.9999 9.55227 21.9999 8.99999H20.9999ZM20.8477 7.23462L21.7715 6.85194L20.8477 7.23462ZM3 8.99999H2C2 9.55227 2.44772 9.99999 3 9.99999V8.99999ZM19.7654 17.8478L20.1481 18.7717L20.1481 18.7717L19.7654 17.8478ZM20.9999 15H21.9999C21.9999 14.4477 21.5522 14 20.9999 14V15ZM20.8477 16.7654L19.9238 16.3827L20.8477 16.7654ZM3 15L3 14C2.73478 14 2.48043 14.1054 2.29289 14.2929C2.10536 14.4804 2 14.7348 2 15H3ZM3.15224 16.7654L2.22836 17.148L2.22836 17.148L3.15224 16.7654ZM15 6C15 5.44772 14.5523 5 14 5C13.4477 5 13 5.44772 13 6H15ZM13 18C13 18.5523 13.4477 19 14 19C14.5523 19 15 18.5523 15 18H13ZM6 7H18V5H6V7ZM18 7C18.4796 7 18.7893 7.00054 19.0262 7.01671C19.2542 7.03227 19.3411 7.05888 19.3827 7.07612L20.1481 5.22836C19.8221 5.09336 19.4922 5.04385 19.1624 5.02135C18.8415 4.99946 18.4523 5 18 5V7ZM21.9999 8.99999C21.9999 8.54773 22.0004 8.15845 21.9785 7.8376C21.956 7.50778 21.9065 7.17786 21.7715 6.85194L19.9238 7.6173C19.941 7.65892 19.9676 7.74575 19.9832 7.97375C19.9994 8.21073 19.9999 8.52036 19.9999 8.99999H21.9999ZM19.3827 7.07612C19.6276 7.17758 19.8222 7.37219 19.9238 7.6173L21.7715 6.85194C21.4671 6.11693 20.8832 5.53288 20.1481 5.22836L19.3827 7.07612ZM4 8.99999C4 8.52036 4.00054 8.21073 4.01671 7.97375C4.03227 7.74575 4.05888 7.65892 4.07612 7.6173L2.22836 6.85194C2.09336 7.17786 2.04385 7.50777 2.02135 7.8376C1.99946 8.15845 2 8.54773 2 8.99999H4ZM6 5C5.54775 5 5.15852 4.99946 4.83772 5.02135C4.5079 5.04386 4.17807 5.09337 3.85218 5.22836L4.61755 7.07612C4.65919 7.05887 4.74599 7.03226 4.97389 7.01671C5.2108 7.00054 5.52037 7 6 7V5ZM4.07612 7.6173C4.17752 7.3725 4.3723 7.17771 4.61755 7.07612L3.85218 5.22836C3.11732 5.53275 2.53293 6.11663 2.22836 6.85194L4.07612 7.6173ZM6 19H18V17H6V19ZM18 19C18.4522 19 18.8415 19.0005 19.1624 18.9787C19.4922 18.9562 19.8221 18.9067 20.1481 18.7717L19.3827 16.9239C19.3411 16.9411 19.2543 16.9677 19.0263 16.9833C18.7893 16.9995 18.4796 17 18 17V19ZM19.9999 15C19.9999 15.4796 19.9994 15.7893 19.9832 16.0262C19.9676 16.2542 19.941 16.3411 19.9238 16.3827L21.7715 17.1481C21.9065 16.8221 21.956 16.4922 21.9785 16.1624C22.0004 15.8415 21.9999 15.4523 21.9999 15H19.9999ZM20.1481 18.7717C20.8832 18.4671 21.4671 17.883 21.7715 17.148L19.9238 16.3827C19.8222 16.6278 19.6276 16.8225 19.3827 16.9239L20.1481 18.7717ZM2 15C2 15.4523 1.99946 15.8415 2.02135 16.1624C2.04385 16.4922 2.09336 16.8221 2.22836 17.148L4.07612 16.3827C4.05888 16.3411 4.03227 16.2542 4.01671 16.0262C4.00054 15.7893 4 15.4796 4 15H2ZM6 17C5.52036 17 5.21079 16.9995 4.97387 16.9833C4.74597 16.9677 4.65918 16.9411 4.61755 16.9239L3.85218 18.7717C4.17809 18.9067 4.50793 18.9562 4.83774 18.9787C5.15853 19.0005 5.54776 19 6 19V17ZM2.22836 17.148C2.53292 17.8833 3.11729 18.4673 3.85218 18.7717L4.61755 16.9239C4.37233 16.8223 4.17754 16.6275 4.07612 16.3827L2.22836 17.148ZM20.9999 14C19.8954 14 19 13.1046 19 12H17C17 14.2091 18.7907 16 20.9999 16V14ZM19 12C19 10.8954 19.8954 9.99999 20.9999 9.99999V7.99999C18.7907 7.99999 17 9.79091 17 12H19ZM3 9.99999C4.10456 9.99999 5 10.8954 5 12L7 12C7 9.79087 5.20914 7.99999 3 7.99999V9.99999ZM5 12C5 13.1046 4.10457 14 3 14L3 16C5.20914 16 7 14.2091 7 12L5 12ZM13 6V18H15V6H13Z" fill="#E14177"/>
        </svg>
            <p>Học phí</p>
        </div>
        <svg class="svg-bottom" xmlns="http://www.w3.org/2000/svg" width="24" height="30" viewBox="0 0 24 30" fill="none">
            <path d="M5 18.75L12 10L19 18.75" stroke="#0C0C0D" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
    </div>
    <div class="fee-deeper">
        <div class="tuition pointer">
            <p>Thanh toán</p>
        </div>
        <div class="fee-info pointer">
            <p>Thông tin học phí</p>
        </div>
    </div>
</div>

<style>
    .sidebar-student {
        display: flex;
        width: 250px;
        height: 100%;
        padding: 20px;
        flex-direction: column;
        align-items: stretch;
        gap: 20px;
        background: var(--White, #FFF);
    }

    .pointer {
        cursor: pointer;
    }

    .general-2:hover, .study-2:hover, .fee-2:hover {
        background-color: rgba(108, 108, 108, 0.1);
        border-radius: 4px;
    }

    .general-2:hover .text p,
    .study-2:hover .text p,
    .fee-2:hover .text p {
        color: #01B3EF;
    }

    .general-deeper:hover, .score:hover, .conduct:hover, .result:hover, .tuition:hover, .fee-info:hover {
        background-color: rgba(108, 108, 108, 0.1);
        border-radius: 4px;
    }

    .general {
        display: flex;
        flex-direction: column;
        align-items: flex-start;
        justify-content: center;
        align-self: stretch;
        cursor: default;
    }

    .general-2 {
        display: flex;
        height: 30px;
        justify-content: space-between;
        align-items: center;
        flex-shrink: 0;
        align-self: stretch;
    }

    .text {
        display: flex;
        height: 30px;
        align-items: center;
        gap: 10px;
        color: #000;
    }

    .text p, .score, .conduct, .result, .tuition, .fee-info,
    .general-deeper p {
        color: #000;
        font-family: Inter;
        font-size: 16px;
        font-style: normal;
        font-weight: 400;
        line-height: normal;
    }

    .general-deeper {
        display: flex;
        flex-direction: column;
        align-items: flex-start;
        align-self: stretch;
        height: 30px;
        padding: 5px 35px;
    }

    .study {
        display: flex;
        flex-direction: column;
        align-items: flex-start;
        justify-content: center;
        align-self: stretch;
        cursor: default;
    }

    .general h1, .fee h1, 
    .study h1 {
        color: var(--Silver, #AFAFAF);
        font-family: Inter;
        font-size: 16px;
        font-style: normal;
        font-weight: 400;
        line-height: normal;
    }

    .study-2 {
        display: flex;
        height: 30px;
        justify-content: space-between;
        align-items: center;
        flex-shrink: 0;
        align-self: stretch;
    }

    .study-deeper {
        display: flex;
        flex-direction: column;
        align-items: flex-start;
        align-self: stretch;
        gap: 20px;
    }

    .score, .conduct, .result, .tuition, .fee-info {
        display: flex;
        height: 30px;
        padding: 0px 35px;
        align-items: center;
        gap: 10px;
        align-self: stretch;
    }

    .fee {
        display: flex;
        flex-direction: column;
        align-items: flex-start;
        justify-content: center;
        align-self: stretch;
        cursor: default;
    }

    
    .fee-2 {
        display: flex;
        height: 30px;
        justify-content: space-between;
        align-items: center;
        flex-shrink: 0;
        align-self: stretch;
    }

    .fee-deeper {
        display: flex;
        flex-direction: column;
        align-items: flex-start;
        align-self: stretch;
        gap: 20px;
    }

    .general-2:hover .svg-bottom path,
    .study-2:hover .svg-bottom path,
    .fee-2:hover .svg-bottom path {
        stroke: #01B3EF;
    }
</style>