app/Controllers/CashierController.php

    public function profile()
    {
        $ThuNganModel = new ThuNganModel();

        // Lấy thông tin tài khoản hiện tại
        $MaTK = session('MaTK');

        // Lấy thông tin ban giám hiệu
        $ThuNgan = $ThuNganModel
            ->select('thungan.*, taikhoan.*')
            ->join('taikhoan', 'taikhoan.MaTK = thungan.MaTK')
            ->where('thungan.MaTK', $MaTK)
            ->first();
---
SELECT `thungan`.*, `taikhoan`.*
FROM `thungan`
JOIN `taikhoan` ON `taikhoan`.`MaTK` = `thungan`.`MaTK`
WHERE `thungan`.`MaTK` = '63'
 LIMIT 1