app/Models/TaiKhoanModel.php

SELECT *
FROM `taikhoan`
WHERE `TenTK` = 'TN0002'
 LIMIT 1
---
    public function findByUsernameWithRole($username)
    {
        $user = $this->where('TenTK', $username)->first();