app/Models/VaiTroModel.php

SELECT *
FROM `vaitro`
WHERE `MaVT` = '4'
 LIMIT 1
---
    public function findRoleById($maVT)
    {
        return $this->where('MaVT', $maVT)->first();